spec/fixtures/vcr_cassettes/Invalid_campaign_movie.yml

--- 
- !ruby/struct:VCR::HTTPInteraction 
  request: !ruby/struct:VCR::Request 
    method: :post
    uri: https://training7.247realmedia.com:443/oasapi/OaxApi
    body: |-
      <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:n1="http://api.oas.tfsm.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><n1:OasXmlRequest xmlns:n1="http://api.oas.tfsm.com/"><String_1>Abril</String_1><String_2>dev_abril</String_2><String_3>d3v@p1SgpD</String_3><String_4>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
      &lt;AdXML&gt;
        &lt;Request type=&quot;Campaign&quot;&gt;
          &lt;Campaign action=&quot;add&quot;&gt;
            &lt;Overview&gt;
              &lt;Id&gt;&lt;/Id&gt;
              &lt;AdvertiserId&gt;&lt;/AdvertiserId&gt;
              &lt;Name&gt;&lt;/Name&gt;
              &lt;AgencyId&gt;&lt;/AgencyId&gt;
              &lt;Description&gt;&lt;/Description&gt;
              &lt;CampaignManager&gt;&lt;/CampaignManager&gt;
              &lt;ProductId&gt;&lt;/ProductId&gt;
              &lt;InternalQuickReport&gt;&lt;/InternalQuickReport&gt;
              &lt;ExternalQuickReport&gt;&lt;/ExternalQuickReport&gt;
            &lt;/Overview&gt;
          &lt;/Campaign&gt;
        &lt;/Request&gt;
      &lt;/AdXML&gt;
      </String_4></n1:OasXmlRequest></env:Body></env:Envelope>
    headers: 
      soapaction: 
      - "\"OasXmlRequest\""
      content-type: 
      - text/xml;charset=UTF-8
  response: !ruby/struct:VCR::Response 
    status: !ruby/struct:VCR::ResponseStatus 
      code: 200
      message: OK
    headers: 
      x-powered-by: 
      - Servlet 2.5; JBoss-5.0/JBossWeb-2.1
      p3p: 
      - CP="NON NID PSAa PSDa OUR IND UNI COM NAV STA",policyref="/w3c/p3p.xml"
      via: 
      - 1.1 training7.247realmedia.com
      content-type: 
      - text/xml;charset=UTF-8
      date: 
      - Thu, 26 May 2011 01:29:55 GMT
      server: 
      - Apache-Coyote/1.1
      transfer-encoding: 
      - chunked
    body: |-
      <?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><ns1:OasXmlRequestResponse xmlns:ns1="http://api.oas.tfsm.com/"><result>&lt;?xml version='1.0'?>
      &lt;AdXML>
      
      &lt;Response>
        &lt;Campaign>
          &lt;Exception errorCode='505'> is an invalid value for Id&lt;/Exception>
        &lt;/Campaign>
      &lt;/Response>
      &lt;/AdXML></result></ns1:OasXmlRequestResponse></soapenv:Body></soapenv:Envelope>
    http_version: "1.1"
- !ruby/struct:VCR::HTTPInteraction 
  request: !ruby/struct:VCR::Request 
    method: :post
    uri: https://training7.247realmedia.com:443/oasapi/OaxApi
    body: |-
      <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:n1="http://api.oas.tfsm.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><n1:OasXmlRequest xmlns:n1="http://api.oas.tfsm.com/"><String_1>Abril</String_1><String_2>dev_abril</String_2><String_3>d3v@p1SgpD</String_3><String_4>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
      &lt;AdXML&gt;
        &lt;Request type=&quot;Campaign&quot;&gt;
          &lt;Campaign action=&quot;add&quot;&gt;
            &lt;Overview&gt;
              &lt;Id&gt;&lt;/Id&gt;
              &lt;AdvertiserId&gt;&lt;/AdvertiserId&gt;
              &lt;Name&gt;&lt;/Name&gt;
              &lt;AgencyId&gt;&lt;/AgencyId&gt;
              &lt;ProductId&gt;&lt;/ProductId&gt;
            &lt;/Overview&gt;
          &lt;/Campaign&gt;
        &lt;/Request&gt;
      &lt;/AdXML&gt;
      </String_4></n1:OasXmlRequest></env:Body></env:Envelope>
    headers: 
      content-type: 
      - text/xml;charset=UTF-8
      soapaction: 
      - "\"OasXmlRequest\""
  response: !ruby/struct:VCR::Response 
    status: !ruby/struct:VCR::ResponseStatus 
      code: 200
      message: OK
    headers: 
      x-powered-by: 
      - Servlet 2.5; JBoss-5.0/JBossWeb-2.1
      p3p: 
      - CP="NON NID PSAa PSDa OUR IND UNI COM NAV STA",policyref="/w3c/p3p.xml"
      content-type: 
      - text/xml;charset=UTF-8
      via: 
      - 1.1 training7.247realmedia.com
      server: 
      - Apache-Coyote/1.1
      date: 
      - Fri, 27 May 2011 13:02:16 GMT
      transfer-encoding: 
      - chunked
    body: |-
      <?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><ns1:OasXmlRequestResponse xmlns:ns1="http://api.oas.tfsm.com/"><result>&lt;?xml version='1.0'?>
      &lt;AdXML>
      
      &lt;Response>
        &lt;Campaign>
          &lt;Exception errorCode='505'> is an invalid value for Id&lt;/Exception>
        &lt;/Campaign>
      &lt;/Response>
      &lt;/AdXML></result></ns1:OasXmlRequestResponse></soapenv:Body></soapenv:Envelope>
    http_version: "1.1"
