spec/fixtures/vcr_cassettes/Oass_Client/_create_campaign.yml

---
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :get
    uri: https://training7.247realmedia.com:443//oasapi/OaxApi?wsdl
    body:
    headers:
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 200
      message: OK
    headers:
      etag:
      - "\"44e617-674-48c8d0448cd40\""
      last-modified:
      - Thu, 29 Jul 2010 20:59:57 GMT
      p3p:
      - CP="NON NID PSAa PSDa OUR IND UNI COM NAV STA",policyref="/w3c/p3p.xml"
      content-type:
      - text/xml
      date:
      - Thu, 26 May 2011 00:57:00 GMT
      server:
      - Apache/2.2.3 (Red Hat)
      content-length:
      - "1652"
      accept-ranges:
      - bytes
    body: |
      <?xml version="1.0" encoding="UTF-8"?>
      <definitions name="OaxApiService" targetNamespace="http://api.oas.tfsm.com/" xmlns:tns="http://api.oas.tfsm.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns="http://schemas.xmlsoap.org/wsdl/">
        <types>
        </types>
        <message name="OaxApi_OasXmlRequestResponse">
          <part name="result" type="xsd:string">
          </part>
        </message>
        <message name="OaxApi_OasXmlRequest">
          <part name="String_1" type="xsd:string">

          </part>
          <part name="String_2" type="xsd:string">
          </part>
          <part name="String_3" type="xsd:string">
          </part>
          <part name="String_4" type="xsd:string">
          </part>
        </message>
        <portType name="OaxApi">

          <operation name="OasXmlRequest" parameterOrder="String_1 String_2 String_3 String_4">
            <input message="tns:OaxApi_OasXmlRequest">
          </input>
            <output message="tns:OaxApi_OasXmlRequestResponse">
          </output>
          </operation>
        </portType>
        <binding name="OaxApiBinding" type="tns:OaxApi">
          <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>

          <operation name="OasXmlRequest">
            <soap:operation soapAction=""/>
            <input>
              <soap:body use="literal" namespace="http://api.oas.tfsm.com/"/>
            </input>
            <output>
              <soap:body use="literal" namespace="http://api.oas.tfsm.com/"/>
            </output>
          </operation>

        </binding>
        <service name="OaxApiService">
          <port name="OaxApiPort" binding="tns:OaxApiBinding">
            <soap:address location="https://training7.247realmedia.com:443/oasapi/OaxApi"/>
          </port>
        </service>
      </definitions>

    http_version: "1.1"
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :post
    uri: https://training7.247realmedia.com:443/oasapi/OaxApi
    body: |-
      <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:n1="http://api.oas.tfsm.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><n1:OasXmlRequest xmlns:n1="http://api.oas.tfsm.com/"><String_1><%= account %></String_1><String_2><%= username %></String_2><String_3><%= password %></String_3><String_4>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;
      &lt;AdXML&gt;
        &lt;Request type=&quot;Campaign&quot;&gt;
          &lt;Campaign action=&quot;add&quot;&gt;
            &lt;Overview&gt;
              &lt;Id&gt;random_id_lolwut_wtf&lt;/Id&gt;
              &lt;AdvertiserId&gt;bobo&lt;/AdvertiserId&gt;
              &lt;Name&gt;LOLWUT&lt;/Name&gt;
              &lt;AgencyId&gt;unknown_agency&lt;/AgencyId&gt;
              &lt;Description&gt;&lt;/Description&gt;
              &lt;CampaignManager&gt;lol&lt;/CampaignManager&gt;
              &lt;ProductId&gt;default-product&lt;/ProductId&gt;
              &lt;InternalQuickReport&gt;&lt;/InternalQuickReport&gt;
              &lt;ExternalQuickReport&gt;&lt;/ExternalQuickReport&gt;
            &lt;/Overview&gt;
          &lt;/Campaign&gt;
        &lt;/Request&gt;
      &lt;/AdXML&gt;
      </String_4></n1:OasXmlRequest></env:Body></env:Envelope>
    headers:
      soapaction:
      - "\"OasXmlRequest\""
      content-type:
      - text/xml;charset=UTF-8
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 200
      message: OK
    headers:
      x-powered-by:
      - Servlet 2.5; JBoss-5.0/JBossWeb-2.1
      p3p:
      - CP="NON NID PSAa PSDa OUR IND UNI COM NAV STA",policyref="/w3c/p3p.xml"
      via:
      - 1.1 training7.247realmedia.com
      content-type:
      - text/xml;charset=UTF-8
      date:
      - Thu, 26 May 2011 00:57:02 GMT
      server:
      - Apache-Coyote/1.1
      transfer-encoding:
      - chunked
    body: |-
      <?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><ns1:OasXmlRequestResponse xmlns:ns1="http://api.oas.tfsm.com/"><result>&lt;?xml version='1.0'?>
      &lt;AdXML>

      &lt;Response>
        &lt;Campaign>Successfully added.&lt;/Campaign>
      &lt;/Response>
      &lt;/AdXML></result></ns1:OasXmlRequestResponse></soapenv:Body></soapenv:Envelope>
    http_version: "1.1"
- !ruby/struct:VCR::HTTPInteraction
  request: !ruby/struct:VCR::Request
    method: :get
    uri: https://training7.247realmedia.com:443//oasapi/OaxApi?wsdl
    body:
    headers:
  response: !ruby/struct:VCR::Response
    status: !ruby/struct:VCR::ResponseStatus
      code: 200
      message: OK
    headers:
      etag:
      - "\"44e617-674-48c8d0448cd40\""
      p3p:
      - CP="NON NID PSAa PSDa OUR IND UNI COM NAV STA",policyref="/w3c/p3p.xml"
      last-modified:
      - Thu, 29 Jul 2010 20:59:57 GMT
      content-type:
      - text/xml
      server:
      - Apache/2.2.3 (Red Hat)
      date:
      - Thu, 26 May 2011 00:57:45 GMT
      content-length:
      - "1652"
      accept-ranges:
      - bytes
    body: |
      <?xml version="1.0" encoding="UTF-8"?>
      <definitions name="OaxApiService" targetNamespace="http://api.oas.tfsm.com/" xmlns:tns="http://api.oas.tfsm.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns="http://schemas.xmlsoap.org/wsdl/">
        <types>
        </types>
        <message name="OaxApi_OasXmlRequestResponse">
          <part name="result" type="xsd:string">
          </part>
        </message>
        <message name="OaxApi_OasXmlRequest">
          <part name="String_1" type="xsd:string">

          </part>
          <part name="String_2" type="xsd:string">
          </part>
          <part name="String_3" type="xsd:string">
          </part>
          <part name="String_4" type="xsd:string">
          </part>
        </message>
        <portType name="OaxApi">

          <operation name="OasXmlRequest" parameterOrder="String_1 String_2 String_3 String_4">
            <input message="tns:OaxApi_OasXmlRequest">
          </input>
            <output message="tns:OaxApi_OasXmlRequestResponse">
          </output>
          </operation>
        </portType>
        <binding name="OaxApiBinding" type="tns:OaxApi">
          <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>

          <operation name="OasXmlRequest">
            <soap:operation soapAction=""/>
            <input>
              <soap:body use="literal" namespace="http://api.oas.tfsm.com/"/>
            </input>
            <output>
              <soap:body use="literal" namespace="http://api.oas.tfsm.com/"/>
            </output>
          </operation>

        </binding>
        <service name="OaxApiService">
          <port name="OaxApiPort" binding="tns:OaxApiBinding">
            <soap:address location="https://training7.247realmedia.com:443/oasapi/OaxApi"/>
          </port>
        </service>
      </definitions>

    http_version: "1.1"
